Repository: Rusutikaa/docs
Catalog: OmegaT_tmx/OmegaT_tmx_FoundationLibraryRef/FoundationLibraryReference-level2.tmx
Source language: en_us
Languages: ja

source: When the sequence is exhausted, the accumulating value is returned to the caller.
ja: シーケンスが使い尽くされる時、蓄積値が呼び出し側へ返されます。

source: When the sequence is exhausted, the last value returned from the closure is returned to the caller.
ja: シーケンスが使い尽くされる時、クロージャから返される最後の値が呼び出し側へ帰されます。

source: When the string proxy is used in string With Format:, the formatter returns a string proxy for a generic string and then formats the string using unknown.
ja: 文字列プロキシがstring With Format:の中で使われる場合、フォーマッタはある汎用文字列に対する文字列プロキシを返します、それらかunknownを使って文字列を書式設定します。

source: When the timer fires, the thread attempts to dequeue the message from the run loop and perform the selector.
ja: タイマーが点火した場合、スレッドはこのメッセージを実行ループからデキューして（待ち行列からはずして）セレクタを実行しようとします。

source: When the user logs in with a different iCloud account, the identity token changes and the system posts the notification.
ja: ユーザが異なるiCloudアカウントでログインする場合、身元トークンは変化して、システムは通知を投函します。

source: When the value for a particular unit is 0, the zero formatting behavior determines whether that value is retained or omitted from any resulting strings.
ja: 特定の単位の値が０である時、このゼロ書式設定挙動は何らかの結果文字列からその値が省かれるか保持されるかを決定します。

source: When this enumeration is present, its cases serve as the authoritative list of properties that must be included when instances of a codable type are encoded or decoded.
ja: この列挙が存在する時、それのケース節は、コード化可能型のインスタンスがエンコードまたはデコードされる時に含められる必要があるプロパティの正式リストとしての機能を果たします。

source: When unspecified, GMT is used.
ja: 指定されない場合、GMTが使われます。

source: When using a file handle object to communicate asynchronously with a socket, you must initiate the corresponding operations from a thread with an active run loop.
ja: ファイルハンドルオブジェクトを使って非同期にソケットと通信する場合、あなたは該当する演算を、アクティブ実行ループを持つスレッドから開始しなければなりません。

source: When using distributed notifications, your app should treat any data passed in the notification as untrusted.
ja: 分散通知を使おうとする場合、あなたのアプリは通知に渡されるあらゆるデータを信用できないものとして扱うべきです。

source: When using positional units, this behavior drops leading zeroes but pads middle and trailing values with zeros as needed.
ja: 位置的な単位を使っている場合、この挙動は先頭のゼロを落とします、しかし真ん中と後に続く値は必要とされるだけゼロで詰め物をします。

source: When using this method to create a file handle object, the file handle owns its associated file descriptor and is responsible for closing it.
ja: このメソッドを使ってファイルハンドルオブジェクトを作成する場合、ファイルハンドルは、それの結び付けられたファイル記述子を所有し、そしてそれを閉じることに責任を持ちます。

source: When working with date representations in ISO 8601 format, use ISO8601Date Formatter instead.
ja: 日付表現をISO 8601フォーマットにおいて扱う場合、ISO8601Date Formatterを代わりに使ってください。

source: When working with fixed format dates, such as RFC 3339, you set the date Format property to specify a format string.
ja: 固定された書式設定日付を扱う場合、例えばRFC 3339など、あなたはdate Formatプロパティを設定して、書式設定文字列を指定します。

source: When writing a file, your handler block is typically executed repeatedly until the entire contents of the file have been written.
ja: ファイルを書き出す場合、あなたのハンドラブロックはたいてい、ファイルの内容全体が書き出されてしまうまで繰り返して実行されます。

source: When writing data to a socket, your handler block is executed whenever the socket is ready to accept more data.
ja: ソケットにデータを書き出す場合、ソケットがもっとデータを受け取る準備ができた時はいつでも、あなたのハンドラブロックは実行されます。

source: When you archive a graph of objects, the class information and instance variables for each object are written to the archive.
ja: あなたがいくらかのオブジェクトからなるあるグラフをアーカイブする場合、各オブジェクトに対してクラス情報とインスタンス変数がアーカイブに書き込まれます。

source: When you build your application, you can merge multiple RTF-based help files together using the /usr/bin/compile Help tool, which then packages your help file information into a property list named Help .plist.
ja: あなたがあなたのアプリケーションをビルドする時、あなたは複数のRTFに基づくヘルプファイルを、/usr/bin/compile Helpツールを使って１つに結合します、それはそれからあなたのヘルプファイル情報をHelp .plistと名付けられるプロパティリストにまとめます。

source: When you call container URL(for Security Application Group Identifier:) with one of your app's group identifiers, the method returns an NSURL instance specifying the location in the file system of that group's shared directory.
ja: あなたがcontainer URL(for Security Application Group Identifier:)をあなたのアプリの持つグループ識別子の１つで呼び出す場合、メソッドは、そのグループの共有ディレクトリのファイルシステムにおける位置を指定しているNSURLインスタンスを返します。

source: When you change the preferred filename, the default implementation of this property causes the existing parent directory file wrappers to remove and re-add the child to accommodate the change.
ja: あなたが優先ファイル名を変更する場合、このプロパティの初期状態の実装は、既存の親ディレクトリファイルラッパーを除去して子を再追加することでその変更に順応します。

source: When you create an instance of NSApple Script object, you can use a URL to specify a script that can be in either text or compiled form, or you can supply the script as a string.
ja: あなたがNSApple Scriptオブジェクトのインスタンスを作成するとき、あなたはテキストまたはコンパイル済み形式のどちらかであることができるスクリプトをURLを使って指定することができます、またはあなたはスクリプトをある文字列として提供できます。

source: When you enumerate a collection, the integer part of each pair is a counter for the enumeration, but is not necessarily the index of the paired value.
ja: あなたがあるコレクションを列挙するとき、各ペアの整数部分は列挙のためのカウンタです、しかし必ずしもペアにされた値のインデックスではありません。

source: When you know the array is nearly sorted, this method is faster than sorted Array(_: context:).
ja: この配列がおおよそソートされるのをあなたが知っているとき、このメソッドはsorted Array(_: context:)よりも高速です。

source: When you need to check whether your collection is empty, use the is Empty property instead of checking that the count property is equal to zero.
ja: あなたのコレクションが空かどうか確認する必要がある場合、is Emptyプロパティを、countプロパティがゼロかどうか調べる代わりに使ってください。

source: When you specify true for the flag parameter, this method attempts to move the file or directory to the cloud and returns true if it is successful.
ja: あなたがtrueをflagパラメータに指定する場合、このメソッドはファイルやディレクトリをクラウドに移動することを試みて、それが成功するならばtrueを返します。

source: When you use an File Manager object to initiate a copy, move, link, or remove operation, the file manager asks its delegate whether the operation should begin at all and whether it should proceed when an error occurs.
ja: あなたがFile Managerオブジェクトを使ってコピー、移動、リンク、または除去操作を始める時、ファイルマネージャはそれの委任先に、操作がそもそも始まるべきかどうかそしてそれはエラー発生の時に続けるべきか尋ねます。

source: When you use this method with mutable subclasses of NSArray, you must not modify the array during enumeration.
ja: あなたがこのメソッドをNSArrayの可変のサブクラスで使うとき、あなたはその配列を列挙の間に修正すべきではありません。

source: When you want to sort a collection of elements that doesn’t conform to the Comparable protocol, pass a closure to this method that returns true when the first element passed should be ordered before the second.
ja: あなたがComparableプロトコルに準拠しない要素からなるコレクションをソートしたい場合、あるクロージャをこのメソッドに渡してください、それは渡された最初の要素が２番目の前に並べられるべき場合はtrueを返すものです。

source: When you want to sort a collection of elements that don’t conform to the Comparable protocol, pass a predicate to this method that returns true when the first element passed should be ordered before the second.
ja: あなたがComparableプロトコルに準拠しない要素からなるコレクションをソートしたい場合、渡された最初の要素が２番目の前に並べられるべき場合はtrueを返す述部をこのメソッドに渡してください。

source: When you want to sort a sequence of elements that don’t conform to the Comparable protocol, pass a predicate to this method that returns true when the first element passed should be ordered before the second.
ja: あなたがComparableプロトコルに準拠しない要素からなるシーケンスをソートしたい場合、渡された最初の要素が２番目の前に並べられるべき場合はtrueを返す述部をこのメソッドに渡してください。

source: When you work with an instance of NSApple Event Descriptor, you can access the underlying descriptor directly, if necessary, with the ae Desc method.
ja: あなたがNSApple Event Descriptorのインスタンスを扱う場合、あなたは基盤となる記述子にae Descメソッドで、必要ならば、直接にアクセスできます。

source: Whenever you make HTTP URL load requests, any response objects you get back from the URLSession, NSURLConnection, or NSURLDownload class are instances of the HTTPURLResponse class.
ja: あなたがHTTP URLロード要請をするたびに、URLSession、NSURLConnection、またはNSURLDownloadクラスからあなたが戻されるあらゆる応答オブジェクトは、HTTPURLResponseクラスのインスタンスです。

source: Whether descendant file wrappers’filename properties are set if the writing succeeds.
ja: 行き先ファイルラッパーの持つfilenameプロパティが書き出しが成功するならば設定されるかどうか。

source: Whether file mapping for regular file wrappers is disallowed.
ja: 通常ファイルラッパーに対するファイルマッピングがデアロケートされるかどうか。

source: Whether this method recurses through subdirectories is dependent on the extension parameter.
ja: このメソッドが下位ディレクトリをくまなく再帰呼び出しするかどうかは、extensionパラメータに依存します。

source: Whether to create the directory if it does not already exist.
ja: それがまだ存在しないならば、ディレクトリを作成するかどうか。

source: Whether writing is done atomically.
ja: 書き出しが自動的に行われるかどうか。

source: Which components to compare.
ja: 比較するのはどの構成要素か。

source: Which direction in time to search.
ja: 時間で、どっちの方向を検索するか。

source: While the condition is not true, the thread blocks.
ja: 条件が真でない間は、スレッドは封鎖されます。

# White space is defined as [ fp{Z}].
source: White space is defined as [\t\n\f\r\p{Z}].
ja: 空白は、 [\t\n\f\r\p{Z}]として定義されます。

source: Without using this option (and reusing child file wrappers properly), subsequent invocations of write(to: options: original Contents URL:) would not be able to reliably create hard links in a new file package, because the record of names in the old file package would be out of date.
ja: このオプションの使用（そして子ファイルラッパーの適切な再利用）なしに、その後のwrite(to: options: original Contents URL:)の発動は、ハードリンクを新しいファイルパッケージの中で期待通りに作成できないでしょう。

source: Word characters are [\p{Ll}\p{Lu}\p{Lt}\p{Lo}\p{Nd}].
ja: 単語文字は、[\p{Ll}\p{Lu}\p{Lt}\p{Lo}\p{Nd}]です。

source: Work with primitive values and other fundamental types used throughout Cocoa.
ja: Cocoaの至る所で使われるプリミティブな値と他の基本的な型を扱います。

source: Working With Apple Event Descriptors
ja: アップルイベント記述子を扱う

source: Working With Fixed Format Date Representations
ja: 固定された書式設定日付表現を扱う

source: Working With List Descriptors
ja: リスト記述子を扱う

source: Working With Record Descriptors
ja: レコード記述子を扱う

source: Working With User-Visible Representations of Dates and Times
ja: ユーザが見ることができる日付と時刻の表現を扱う

source: Working with Class Descriptions
ja: クラス記述を扱う

source: Working with Custom Units
ja: あつらえの単位を扱う

source: Working with Encodings
ja: エンコーディングを扱う

source: Working with Icons
ja: アイコンを扱う

source: Working with Paths
ja: パスを扱う

source: Working with Special Node Names
ja: 特別なノード名を扱う

source: Working with event handlers
ja: イベントハンドラーを扱う

source: Working with events
ja: イベントを扱う

source: Working with handlers
ja: ハンドラを扱う

source: Working with object specifiers
ja: オブジェクト指定子を扱う

source: Write error because because the volume is read only.
ja: ボリュームが読み出し専用であるのが原因での書き出しエラー。

source: Write error because of a lack of disk space.
ja: ディスクの空きの不足が原因での書き出しエラー。

source: Write error because of a permission problem.
ja: 権限問題が原因での書き出しエラー。

source: Write error because of an invalid file name.
ja: 無効なファイル名が原因での書き出しエラー。

source: Write error because the specified URL scheme is unsupported.
ja: 指定されたURLスキームがサポートされないのが原因での書き出しエラー。

source: Write error because the string encoding was not applicable.
ja: 文字列エンコーディングが適用できなかったのが原因での書き出しエラー。

source: Write error returned when NSFileManager class’s copy, move, and link methods report errors when the destination file already exists.
ja: 行き先ファイルが既に存在する場合にNSFileManagerクラスの持つコピー、移動、そしてリンクのメソッドがエラーを報告するときに返される書き出しエラー。

source: Write error, reason unknown.
ja: 書き出しエラー、理由不明。

source: Write messages are no-ops, whereas file Descriptor returns an illegal value.
ja: 書き込みメッセージはノーオペレーションです、file Descriptorは不正な値を返すけれども。

source: Writes a file wrapper’s contents to a given file-system node.
ja: ファイルラッパーの持つ内容をある与えられたファイルシステムノードに書き込みます。

source: Writes the contents of the data buffer to a location.
ja: データバッファの内容をある位置へ書き込みます。

source: Writing Files
ja: ファイル書き出し

source: Writing options that can be set by the write(to: options: original Contents URL:) method.
ja: write(to: options: original Contents URL:)メソッドによって設定されることが可能である書き込みオプション。

source: Writing to a File Handle
ja: ファイルハンドルに書き込む

source: Writing to a File or URL
ja: ファイルまたはURLに書き込む

source: XML Processing and Modeling
ja: XMLの処理とモデリング

source: You adopt this approach by implementing the Encodable and Decodable protocols on your custom types.
ja: あなたはこの取り組みをEncodableとDecodableプロトコルをあなたのあつらえの型で実装することで採用します。

source: You also use it to get information about a file or directory or change some of its attributes.
ja: あなたはまた、それを使ってファイルやディレクトリの情報を得たり、それの属性の幾つかを変更します。

source: You also use this method to sort elements that conform to the Comparable protocol in descending order.
ja: あなたはまた、このメソッドを使ってComparableプロトコルに準拠する要素を降順でソートすることができます。

source: You are encouraged to transition to these new Foundation Units and Measurements APIs whenever possible.
ja: あなたは、それらの新しいFoundation単位と測定APIに可能な場合は必ず移行することを奨励されます。

source: You are free to add or remove subdirectories as you see fit, but you are encouraged to use these standardized locations as you would in the app's usual container.
ja: あなたは、あなたが適当と思う通りに自由に下位ディレクトリを追加または除去します、しかしあなたはそれら標準化された場所をあなたがアプリの持つ通常のコンテナの中でするように使うのは推奨されません。

source: You are free to use the group directory as you see fit, but take care to coordinate its structure among all the group's apps.
ja: あなたは、グループディレクトリを自由にあなたが適当と思う通りに使います、しかしグループの持つアプリ全ての間で、それの構造を調和させるように注意してください。

source: You are responsible for subsequently releasing the object, as illustrated in this example:
ja: あなたは、その後のオブジェクトの解除について責任があります、この例で図解されるように：

source: You call this method in a try expression and handle any errors in the catch clauses of a do statement, as described in Error Handling in The Swift Programming Language (Swift 4.1) and Error Handling in Using Swift with Cocoa and Objective-C (Swift 4.1).
ja: あなたはこのメソッドをtryの中で呼び出して、あらゆるエラーをdo文のcatch節で取り扱います、The Swift Programming Language (Swift 4.1)のError HandlingそしてUsing Swift with Cocoa and Objective-C (Swift 4.1)のError Handlingで記述されます。

source: You can add an array of Coordinate instances to Landmark, and the entire structure will still satisfy Codable.
ja: あなたはCoordinateインスタンスからなる配列をLandmarkに追加できます、そして構造体全体は依然としてCodableを満たします。

source: You can add information to the descriptor with methods such as set Attribute(_: for Keyword:), set Descriptor(_: for Keyword:), and set Param(_: for Keyword:).
ja: あなたは、情報をこの記述子に追加することが幾つかのメソッド、例えばset Attribute(_: for Keyword:)、set Descriptor(_: for Keyword:)、そしてset Param(_: for Keyword:)などで行えます。

source: You can add items to the empty list descriptor with insert(_: at:).
ja: あなたは、いくらかの項目を空のリスト記述子にinsert(_: at:)で加えることができます。

source: You can add items to the list by calling insert(_: at:) or remove them with remove(at:).
ja: あなたは、そのリストに項目を加えることがinsert(_: at:)を呼び出すことによって、またremove(at:)でそれらを除去することができます。

source: You can also combine the options described in File Manager .Item Replacement Options using the C-bitwise OR operator.
ja: あなたはまた、File Manager .Item Replacement Optionsで記述されるオプションをCビット単位OR演算子を使って結合できます。

source: You can also define your own NSDimension subclass to represent an entirely new unit dimension.
ja: あなたはまた、あなた自身のNSDimensionサブクラスを定義して、まったく新しい単位寸法を表せます。

source: You can also obtain a bookmark from an NSURL object, which is similar to an alias and offers a more sure way of locating the file or directory later.
ja: あなたはまた、NSURLオブジェクトからブックマークを得ることができます、それはエイリアスに似ています、そして後でファイルやディレクトリの位置決めをするいっそう確実な方法を提供します。

source: You can also setup an Port object to receive and distribute messages from other threads.
ja: あなたはまた、Portオブジェクトを準備して、他のスレッドからメッセージを受け取りそして配達できます。

source: You can also use inverse matrices in conjunction with the concat() method to remove the effects of concatenating the matrix to the current transformation matrix of the current graphic context.
ja: あなたはまた、逆行列をconcat()メソッドと連携して使うことで、現在のグラフィックコンテキストの現在の変換行列に対する連鎖的行列効果を取り除くことができます。

source: You can also use related keys to determine the current progress in downloading the file.
ja: あなたはまた、関連したキーを使ってファイルのダウンロードでの現在の進捗を明らかにできます。

source: You can also use the resolving Symlinks In Path method of NSString to resolve links in the path before retrieving the item’s attributes.
ja: あなたはまた、NSStringのresolving Symlinks In Pathメソッドを使ってパスの中のリンクを、項目の持つ属性を回収する前に解決できます。

source: You can also use the bundle With Path: class method to obtain a bundle identified by its directory path.
ja: あなたはまた、bundle With Path:クラスメソッドを使って、それのディレクトリパスによって識別されるバンドルを取得できます。

source: You can also use the bundle With URL: class method to obtain a bundle identified by its file URL.
ja: あなたはまた、bundle With URL:クラスメソッドを使って、それのファイルURLによって識別されるバンドルを取得できます。

source: You can also use the methods and properties of this class to get the location of known bundle directories and to retrieve resources specifically from those directories.
ja: あなたはまた、このクラスのメソッドとプロパティを使って、既知のバンドルディレクトリの位置を取得して、リソースを取ってくることがそれらのディレクトリからに限定して可能です。

source: You can always create bundle objects from a known URL or path, but other methods make it easier to access bundles your app is already using.
ja: あなたは常にバンドルオブジェクトを既知のURLやパスから作成できます、しかし他のメソッドはあなたのアプリがもう既に使っているバンドルへのアクセスをより簡単にします。

source: You can change single attributes or any combination of attributes; you need not specify keys for all attributes.
ja: あなたは、単一の属性または任意の組み合わせの属性を変更できます；あなたは、すべての属性に対するキーを指定する必要はありません。

source: You can change the value of this property by calling the change Current Directory Path(_:) method.
ja: あなたは、このプロパティの値をchange Current Directory Path(_:)メソッドを呼び出すことによって変更できます。

source: You can change this value to a different locale to generate strings based on that locale.
ja: あなたは、この値を異なるロケールに変更して、そのロケールに基づいて文字列を生成できます。

source: You can change this value to a different time zone to generate strings based on that time zone.
ja: あなたは、この値を異なるタイムゾーンに変更して、そのタイムゾーンに基づいて文字列を生成できます。

source: You can change this value to use a different calendar for interpreting dates.
ja: あなたは、日付を解釈するために、この値を異なるカレンダーに変更できます。

source: You can configure the format used to parse and generate representations by specifying various combinations of format options.
ja: あなたは、構文解析に使用される書式設定を構成設定して、書式設定オプションの様々な組み合わせを指定することによってそれら表現を生成することが可能です。

source: You can configure which metadata is preserved using the options parameter.
ja: あなたは、どのメタデータが保たれるかoptionsパラメータを使って構成設定できます。

source: You can create a file handle for a socket by using the result of a socket call as file Descriptor.
ja: あなたは、ソケットに対してファイルハンドルを作成することが、socket呼び出しの結果をfile Descriptorとして使うことによって行えます。

source: You can create a new instance of Unit Length as follows:
ja: あなたは、Unit Lengthの新しいインスタンスを次のように作成できます：

source: You can create a new subclass of NSDimension to describe a new unit dimension.
ja: あなたは、NSDimensionの新しいサブクラスを作成して、新しい単位寸法を記述できます。

source: You can create a unit converter for a base unit using the Unit Converter Linear init(coefficient:) initializer, passing 1 as the coefficient.
ja: あなたは、基本単位に対する単位コンバータを作成することが、Unit Converter Linear init(coefficient:)イニシャライザを、1を係数として渡して使うことで行えます。

source: You can create empty or pre-populated buffers from a variety of sources and later add or remove bytes.
ja: あなたは、空のまたは事前入力されたバッファをさまざまなソースから作成して、そして後でバイトを追加または除去できます。

source: You can define a custom unit for an existing NSDimension subclass by either calling the init(symbol: converter:) method or extending the subclass and adding a corresponding class method.
ja: あなたは、既存のNSDimensionサブクラスに対してあつらえの単位を定義することが、init(symbol: converter:)メソッドを呼び出すこと、またはサブクラスを拡張して対応するクラスメソッドを加えることのどちらかによって行えます。

source: You can filter and sort the content, or compare against other buffers.
ja: あなたは、内容をフィルタおよびソート、または他のバッファと比較できます。

source: You can further refine notifications by disabling automatic observer notifications and implementing manual notifications using the methods in this protocol.
ja: あなたは、さらにすすめて通知を改良することが、自動監視通知を作動しないようにして手動通知をこのプロトコルのメソッドを使って実装することによって可能です。

source: You can get the set this property to true and the includes Count to true individually to get both parts, separately.
ja: あなたは、このプロパティをtrueにそしてincludes Countをtrueに個々に設定し得ることで、両方の部分を別々に得られます。

source: You can get the set this property to true and the includes Unit to true individually to get both parts, separately.
ja: あなたは、このプロパティをtrueにそしてincludes Unitをtrueに個々に設定し得ることで、両方の部分を別々に得られます。

source: You can implement a Custom Unit Radioactivity class that defines both units of radioactivity as follows:
ja: あなたはCustom Unit Radioactivityクラスを実装できます、それは放射能の単位の両方とも定義します、以下のように：

source: You can implement this method in your handler to monitor file operations.
ja: あなたは、このメソッドをあなたのハンドラの中で実装して、ファイル操作を監視できます。

source: You can manipulate subranges of bytes and iterate over some or all of them.
ja: あなたは、バイトの下位範囲を操作できます、そしてそれらの幾つかまたは全てにわたって反復できます。

source: You can observe any object properties including simple attributes, to-one relationships, and to-many relationships.
ja: あなたは、単純な属性、対一関係、そして対多関係を含めて、あらゆるオブジェクトプロパティを監視できます。

source: You can override the copy Scripting Value method to take more control when your application is sent a duplicate command.
ja: あなたは、copy Scripting Valueメソッドをオーバーライドして、より多くの制御をすることが、あなたのアプリケーションがduplicateコマンドを送られるときに可能です。

source: You can override the new Scripting Object Of Class method to take more control when your application is sent a make command.
ja: あなたは、new Scripting Object Of Classメソッドをオーバーライドして、より多くの制御をすることが、あなたのアプリケーションがmakeコマンドを送られるときに可能です。

source: You can override this method in a subclass.
ja: あなたは、このメソッドをサブクラスにおいてオーバーライドできません。

source: You can override this method to relinquish resources the receiver has obtained, as shown in the following example:
ja: あなたはこのメソッドをオーバーライドして、レシーバが獲得しているリソースを放棄することができます、以下の例で示すように：

source: You can provide a different number formatter to customize the energy string’s appearance.
ja: あなたは、エネルギー文字列の外観を好みに合わせて変更するために異なった数値書式設定を提供できます。

source: You can reverse a collection without allocating new space for its elements by calling this reversed() method.
ja: あなたは、あるコレクションを逆順にすることがそれの要素に対して新しい空間を割り当てることなくreversed()メソッドによって可能です。

source: You can set following: NSFile Busy, NSFile Creation Date, NSFile Extension Hidden, NSFile Group Owner Account ID, NSFile Group Owner Account Name, NSFile HFSCreator Code, NSFile HFSType Code, NSFile Immutable, NSFile Modification Date, NSFile Owner Account ID, NSFile Owner Account Name, NSFile Posix Permissions.
ja: あなたは以下の属性を設定できます：NSFile Busy, NSFile Creation Date, NSFile Extension Hidden, NSFile Group Owner Account ID, NSFile Group Owner Account Name, NSFile HFSCreator Code, NSFile HFSType Code, NSFile Immutable, NSFile Modification Date, NSFile Owner Account ID, NSFile Owner Account Name, NSFile Posix Permissions。

source: You can set the following attributes: busy, creation Date, extension Hidden, group Owner Account ID, group Owner Account Name, hfs Creator Code, hfs Type Code, immutable, modification Date, owner Account ID, owner Account Name, posix Permissions.
ja: あなたは以下の属性を設定できます：busy, creation Date, extension Hidden, group Owner Account ID, group Owner Account Name, hfs Creator Code, hfs Type Code, immutable, modification Date, owner Account ID, owner Account Name, posix Permissions。

source: You can set the owner and group numbers, file permissions, and modification date.
ja: あなたは、所有者とグループ番号、ファイル権限、そして修正日を設定できます。

source: You can sort any collection of elements that conform to the Comparable protocol by calling this method.
ja: あなたはComparableプロトコルに準拠する要素からなるあらゆる配列をこのメソッドを呼び出すことによってソートできます。

source: You can sort any mutable collection of elements that conform to the Comparable protocol by calling this method.
ja: あなたはComparableプロトコルに準拠する要素からなるあらゆる可変の配列をこのメソッドを呼び出すことによってソートできます。

source: You can sort any sequence of elements that conform to the Comparable protocol by calling this method.
ja: あなたはいくらかの要素からなる何らかのシーケンスでComparableプロトコルに準拠するものをこのメソッドを呼び出すことによってソートする（並び替える）ことができます。

source: You can specify concurrent and/or reverse as enumeration options to modify this behavior.
ja: あなたは、concurrentおよび／またはreverseを列挙オプションとして指定してこの挙動を変えることができます。

source: You can specify NSEnumeration Concurrent and/or NSEnumeration Reverse as enumeration options to modify this behavior.
ja: あなたは、NSEnumeration Concurrentおよび／またはNSEnumeration Reverseを列挙オプションとして指定してこの挙動を変えることができます。

source: You can specify k Any Transaction ID if the Apple event is not one of a series of interdependent Apple events.
ja: あなたは、そのアップルイベントが相互依存のアップルイベントの一続きの１つでないならば、k Any Transaction IDを指定できます。
